In [30]:
# Important Series Method

In [4]:
import numpy as np
import pandas as pd

In [20]:
# bollywood
bollywood = pd.read_csv("bollywood.csv",index_col="movie")
bollywood.head(2)

                                   lead
movie
Uri: The Surgical Strike  Vicky Kaushal
Battalion 609               Vicky Ahuja

In [12]:
# subs
subs = pd.read_csv("subs.csv")
subs.head(2)

   Subscribers gained
0                  48
1                  57

In [19]:
# kohli
kohli = pd.read_csv("kohli_ipl.csv",index_col="match_no")
kohli.head(2)

          runs
match_no
1            1
2           23

In [21]:
# astype
import sys
sys.getsizeof(kohli)

3472

In [22]:
sys.getsizeof(kohli.astype("int16"))

2182

In [29]:
# between
# runs between 51 and 99(both 51 and 99 are inclusive)
kohli[kohli["runs"].between(51,99)]

          runs
match_no
34          58
41          71
44          56
45          67
52          70
57          57
68          73
71          51
73          58
74          65
80          57
81          93
82          99
85          56
97          67
99          73
103         51
104         62
110         82
116         75
117         79
119         80
122         52
127         75
129         54
131         54
132         62
134         64
137         55
141         58
144         57
145         92
148         68
152         70
160         84
162         67
175         72
178         90
188         72
197         51
198         53
209         58
213         73

In [33]:
# clip
# jho values 100 sa below hongy wo 100 hojayengy or jho values 200 sa above hongy wo 200 hojayengy and values in between 100 and 200 remain same.
subs

     Subscribers gained
0                    48
1                    57
2                    40
3                    43
4                    44
..                  ...
360                 231
361                 226
362                 155
363                 144
364                 172

[365 rows x 1 columns]

In [34]:
subs.clip(100,200)

     Subscribers gained
0                   100
1                   100
2                   100
3                   100
4                   100
..                  ...
360                 200
361                 200
362                 155
363                 144
364                 172

[365 rows x 1 columns]

In [36]:
# drop_duplicates
temp_series = pd.Series([11,22,11,22,33,33,44,44])
temp_series

0    11
1    22
2    11
3    22
4    33
5    33
6    44
7    44
dtype: int64

In [37]:
temp_series.drop_duplicates()

0    11
1    22
4    33
6    44
dtype: int64

In [42]:
# duplicated
# check how many duplicate values are in a series.
temp_series.duplicated().sum()

4

In [44]:
temp_nan = pd.Series([1,2,3,np.nan,5,6,np.nan,8,9,np.nan])
temp_nan

0    1.0
1    2.0
2    3.0
3    NaN
4    5.0
5    6.0
6    NaN
7    8.0
8    9.0
9    NaN
dtype: float64

In [45]:
# size nan values ko bhi consider karta ha 
temp_nan.size

10

In [46]:
# count sirf non-null values ko consider karta ha 
temp_nan.count()

7

In [55]:
# isnull()
# how many missing values are in temp_nan
temp_without_nan = temp_nan.isnull().sum()
temp_without_nan

3

In [53]:
# dropna()
temp_nan.dropna()

0    1.0
1    2.0
2    3.0
4    5.0
5    6.0
7    8.0
8    9.0
dtype: float64

In [57]:
# fillna()
temp_fill = temp_nan.fillna(temp_nan.mean())
temp_fill

0    1.000000
1    2.000000
2    3.000000
3    4.857143
4    5.000000
5    6.000000
6    4.857143
7    8.000000
8    9.000000
9    4.857143
dtype: float64

In [59]:
temp_fill_0 = temp_nan.fillna(0)
temp_fill_0

0    1.0
1    2.0
2    3.0
3    0.0
4    5.0
5    6.0
6    0.0
7    8.0
8    9.0
9    0.0
dtype: float64

In [66]:
# isin()
kohli[kohli["runs"].isin([49,99])]

          runs
match_no
82          99
86          49

In [72]:
subs[subs["Subscribers gained"].isin([33,50])]

    Subscribers gained
6                   33
22                  50
31                  50
32                  50
42                  33

In [80]:
# apply
# this data contains more than one column
bollywood_df = pd.read_csv("bollywood.csv",index_col="movie")

# stack method
bollywood_series = bollywood_df.stack()
bollywood_series

movie
Uri: The Surgical Strike              lead       Vicky Kaushal
Battalion 609                         lead         Vicky Ahuja
The Accidental Prime Minister (film)  lead         Anupam Kher
Why Cheat India                       lead       Emraan Hashmi
Evening Shadows                       lead    Mona Ambegaonkar
                                                    ...
Hum Tumhare Hain Sanam                lead      Shah Rukh Khan
Aankhen (2002 film)                   lead    Amitabh Bachchan
Saathiya (film)                       lead        Vivek Oberoi
Company (film)                        lead          Ajay Devgn
Awara Paagal Deewana                  lead        Akshay Kumar
Length: 1500, dtype: object

In [95]:
bollywood_series.apply(lambda x: x.split(" ")[0].upper())

movie
Uri: The Surgical Strike              lead      VICKY
Battalion 609                         lead      VICKY
The Accidental Prime Minister (film)  lead     ANUPAM
Why Cheat India                       lead     EMRAAN
Evening Shadows                       lead       MONA
                                               ...
Hum Tumhare Hain Sanam                lead       SHAH
Aankhen (2002 film)                   lead    AMITABH
Saathiya (film)                       lead      VIVEK
Company (film)                        lead       AJAY
Awara Paagal Deewana                  lead     AKSHAY
Length: 1500, dtype: object

In [114]:
mean_value = subs["Subscribers gained"].mean()
subs["Subscribers gained"].apply(lambda x : "good day" if x > mean_value else "bad day")
# mean_value

0       bad day
1       bad day
2       bad day
3       bad day
4       bad day
         ...
360    good day
361    good day
362    good day
363    good day
364    good day
Name: Subscribers gained, Length: 365, dtype: object

In [112]:
type(subs)

pandas.core.frame.DataFrame

In [116]:
# difference between copy and view

In [117]:
# head and tail give you the view of the data (means original data)

In [122]:
new = kohli["runs"].head()

In [124]:
new[1] = 0

In [125]:
new

match_no
1     0
2    23
3    13
4    12
5     1
Name: runs, dtype: int64

In [127]:
kohli["runs"]
# tu yahan bhi changes reflect hogay

match_no
1       0
2      23
3      13
4      12
5       1
       ..
211     0
212    20
213    73
214    25
215     7
Name: runs, Length: 215, dtype: int64

In [130]:
# to avoid this we use copy function
new2 = kohli["runs"].head().copy()
new2

match_no
1     0
2    23
3    13
4    12
5     1
Name: runs, dtype: int64

In [131]:
new2[1] = 100

In [132]:
new2

match_no
1    100
2     23
3     13
4     12
5      1
Name: runs, dtype: int64

In [134]:
kohli["runs"]
# abh dekho jab hamna copy function use kiya tu changes reflect nahi hoya

match_no
1       0
2      23
3      13
4      12
5       1
       ..
211     0
212    20
213    73
214    25
215     7
Name: runs, Length: 215, dtype: int64